Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The "extension_data" field of this extension contains a "NamedGroupList" value:
zh_cn: 此扩展的“extension_data”字段包含“NamedGroupList”值：

source: The "extension_data" field of this extension contains a "PreSharedKeyExtension" value:
zh_cn: 此扩展的“extension_data”字段包含“PreSharedKeyExtension”值：

source: The "extension_data" field of this extension contains a "supported_signature_algorithms" value.
zh_cn: 此扩展的“extension_data”字段包含“supported_signature_algorithms”值。

source: The "extension_data" field of this extension contains an "EarlyDataIndication" value.
zh_cn: 此扩展的“extension_data”字段包含“EarlyDataIndication”值。

source: The "http" URI scheme is hereby defined for the purpose of minting identifiers according to their association with the hierarchical namespace governed by a potential HTTP origin server listening for TCP ([RFC0793]) connections on a given port.
zh_cn: “http”URI 方案的定义是为了根据标识符与层次命名空间的关联来生成标识符，层次命名空间由监听给定端口上 TCP([RFC0793])连接的潜在 HTTP 源服务器控制。

source: The "http" scheme is used to locate network resources via the HTTP protocol.
zh_cn: “http”方案用于通过 HTTP 协议定位网络资源。

source: The "https" URI scheme is hereby defined for the purpose of minting identifiers according to their association with the hierarchical namespace governed by a potential HTTP origin server listening to a given TCP port for TLS-secured connections ([RFC5246]).
zh_cn: “https”URI 方案的定义是为了根据标识符与层次命名空间的关联来生成标识符，该层次命名空间由潜在的 HTTP 源服务器控制，该服务器监听给定的 TCP 端口以进行 TLS 安全连接([RFC5246])。

source: The "identity" transfer coding token has been removed.
zh_cn: 已删除“identity”传输编码标记。

source: The "key_share" extension contains the endpoint's cryptographic parameters.
zh_cn: “key_share”扩展包含端点的加密参数。

source: The "none" value is provided for future extensibility, in case of a signature algorithm which does not require hashing before signing.
zh_cn: 如果签名算法在签名之前不需要散列，则提供“none”值以用于将来的可扩展性。

source: The "oid_filters" extension allows servers to provide a set of OID/value pairs which it would like the client's certificate to match.
zh_cn: “oid_filters”扩展允许服务器提供一组 OID/值对，它们希望客户端的证书匹配。

source: The "post_handshake_auth" extension is used to indicate that a client is willing to perform post-handshake authentication (Section 4.6.2).
zh_cn: “post_handshake_auth”扩展用于表示客户端愿意执行握手后身份验证(第 4.6.2 节)。

source: The "pre_shared_key" extension is used to negotiate the identity of the pre-shared key to be used with a given handshake in association with PSK key establishment.
zh_cn: “pre_shared_key”扩展用于协商与 PSK 密钥建立相关联的给定握手使用的预共享密钥的标识。

source: The "signature_algorithms" extension MUST be specified, and other extensions may optionally be included if defined for this message.
zh_cn: 必须指定“signature_algorithms”扩展，如果为此消息定义，则可以选择包含其他扩展。

source: The "signature_algorithms_cert" extension applies to signatures in certificates, and the "signature_algorithms" extension, which originally appeared in TLS 1.2, applies to signatures in CertificateVerify messages.
zh_cn: “signature_algorithms_cert”扩展适用于证书中的签名，及最初出现在 TLS 1.2 中的“signature_algorithms”扩展适用于 CertificateVerify 消息中的签名。

source: The "signature_algorithms_cert" extension was added to allow implementations which supported different sets of algorithms for certificates and in TLS itself to clearly signal their capabilities.
zh_cn: 添加了“signature_algorithms_cert”扩展，以允许支持不同证书集的实现，并在 TLS 本身中明确表示其功能。

source: The "supported_versions" extension is used by the client to indicate which versions of TLS it supports and by the server to indicate which version it is using.
zh_cn: 客户端使用“supported_versions”扩展来指示它支持的 TLS 版本以及服务器指示它使用的版本。

source: The "three-way handshake" is the procedure used to establish a connection.
zh_cn: “三次握手”是用于建立连接的过程。

source: The "trusted_ca_keys" extension [RFC6066], which serves a similar purpose but is more complicated, is not used in TLS 1.3 (although it may appear in ClientHello messages from clients which are offering prior versions of TLS).
zh_cn: “trusted_ca_keys”扩展 [RFC6066] 用于类似目的但更复杂，未在 TLS 1.3 中使用(尽管它可能出现在提供 TLS 早期版本的客户端的 ClientHello 消息中)。

source: The "zlib" format defined in RFC 1950 [31] in combination with the "deflate" compression mechanism described in RFC 1951 [29].
zh_cn: RFC 1950 [31] 中定义的“zlib”格式与 RFC 1951 [29] 中描述的“deflate”压缩机制相结合。

source: The 1.x `TestSubject` has been dropped.
zh_cn: 1.x 的 `TestSubject` 已被删除。

source: The 2.x API still supports the main default scheduler types: `computation`, `io`, `newThread` and `trampoline`, accessible through `io.reactivex.schedulers.Schedulers` utility class.
zh_cn: 2.x API 仍支持主要的默认调度器类型：`calculate`，`io`，`newThread` 和 `trampoline`，可通过 `io.reactivex.schedulers.Schedulers` 实用程序类访问。

source: The 2.x `Single` reactive base type, which can emit a single `onSuccess` or `onError` has been redesigned from scratch.
zh_cn: 2.x 重新设计的 `Single` 响应基类型，它可以发出单个 `onSuccess` 或 `onError` 。

source: The 2.x redesigned the `RxJavaPlugins` class which now supports changing the hooks at runtime.
zh_cn: 2.x 重新设计了 `RxJavaPlugins` 类，它现在支持在运行时更改钩子。

source: The Worker is also a Subscription and so you can (and should, eventually) call its unsubscribe method to signal that it can halt work and release resources:
zh_cn: Worker 也是 Subscription，因此您可以(通常也应该)调用其 unsubscribe 方法来表示它可以停止工作和释放资源：

source: The onError method takes as its parameter an indication of what caused the error.
zh_cn: onError 方法将导致错误的原因作为其参数。

source: The <major> number is incremented when the format of a message within the protocol is changed.
zh_cn: 当协议内的消息格式发生变化时，<major> 号会递增。

source: The <minor> number is incremented when the changes made to the protocol add features which do not change the general message parsing algorithm, but which may add to the message semantics and imply additional capabilities of the sender.
zh_cn: 当对协议所做的更改添加不改变一般消息解析算法但可能添加到消息语义并暗示发送方的附加功能的特征时，<minor> 数字会递增。

source: The SubscribeOn operator changes this behavior by specifying a different Scheduler on which the Observable should operate.
zh_cn: SubscribeOn 操作符通过指定 Observable 应在其上运行的其他 Scheduler 来更改此行为。

source: The ObserveOn operator specifies a different Scheduler that the Observable will use to send notifications to its observers.
zh_cn: ObserveOn 操作符指定 Observable 将用于向其观察者发送通知的另一个 Scheduler。

source: The ABNF notation defines its terminal values to be non-negative integers (codepoints) based on the US-ASCII coded character set [ASCII].
zh_cn: ABNF 表示法根据 US-ASCII 编码字符集 [ASCII] 将其终值定义为非负整数(代码点)。

source: The ABNF of URI-reference, along with the "first-match-wins" disambiguation rule, is sufficient to define a validating parser for the generic syntax.
zh_cn: URI-reference 的 ABNF 以及“first-match-wins”消歧规则足以为通用语法定义验证解析器。

source: The ABNF productions defining header fields now only list the field value.
zh_cn: 现在，定义首部字段的 ABNF 产品仅列出字段值。

source: The ABNF provided here is a translation of the text definition of an IPv6 literal address provided in [RFC3513].
zh_cn: 这里提供的 ABNF 是 [RFC3513] 中提供的 IPv6 文字地址的文本定义的翻译。

source: The ABNF requires five separate rules to disambiguate these cases, only one of which will match the path substring within a given URI reference.
zh_cn: ABNF 需要五个单独的规则来消除这些情况的歧义，其中只有一个与给定 URI 引用中的路径子字符串匹配。

source: The AEAD output consists of the ciphertext output from the AEAD encryption operation.
zh_cn: AEAD 输出包括 AEAD 加密操作的密文输出。

source: The BWS rule is used where the grammar allows optional whitespace only for historical reasons.
zh_cn: BWS 规则用于语法仅出于历史原因允许可选空格的情况。

source: The CONNECT method requests that the recipient establish a tunnel to the destination origin server identified by the request-target and, if successful, thereafter restrict its behavior to blind forwarding of packets, in both directions, until the tunnel is closed.
zh_cn: CONNECT 方法请求接收方建立到由请求目标标识的目标源服务器的隧道，并且如果成功，则此后将其行为限制为在两个方向上盲转发分组，直到隧道关闭。

source: The Certificate and CertificateVerify messages are only sent under certain circumstances, as defined below.
zh_cn: Certificate 和 CertificateVerify 消息仅在某些情况下发送，如下所述。

source: The CertificateVerify message also provides integrity for the handshake up to this point.
zh_cn: CertificateVerify 消息还为此时的握手提供完整性。

source: The ChangeCipherSpec message is sent by both the client and the server to notify the receiving party that subsequent records will be protected under the newly negotiated CipherSpec and keys.
zh_cn: 客户端和服务器都发送 ChangeCipherSpec 消息，以通知接收方后续记录将在新协商的 CipherSpec 和密钥下受到保护。

source: The ChangeCipherSpec message is sent during the handshake after the security parameters have been agreed upon, but before the verifying Finished message is sent.
zh_cn: 在协商安全参数之后但在发送验证完成消息之前，在握手期间发送 ChangeCipherSpec 消息。

source: The ClientHello and ServerHello are used to establish security enhancement capabilities between client and server.
zh_cn: ClientHello 和 ServerHello 用于在客户端和服务器之间建立安全增强功能。

source: The ClientHello and ServerHello establish the following attributes: Protocol Version, Session ID, Cipher Suite, and Compression Method.
zh_cn: ClientHello 和 ServerHello 建立以下属性：协议版本，会话 ID，加密套件和压缩方法。

source: The ClientHello includes a list of compression algorithms supported by the client, ordered according to the client's preference.
zh_cn: ClientHello 包含客户端支持的压缩算法列表，根据客户端的偏好进行排序。

source: The ClientHello message includes a random structure, which is used later in the protocol.
zh_cn: ClientHello 消息包括随机结构，稍后将在协议中使用。

source: The ClientHello message includes a variable-length session identifier.
zh_cn: ClientHello 消息包括可变长度的会话标识符。

source: The ClientKeyExchange message is now sent, and the content of that message will depend on the public key algorithm selected between the ClientHello and the ServerHello.
zh_cn: 现在发送 ClientKeyExchange 消息，该消息的内容将取决于在 ClientHello 和 ServerHello 之间选择的公钥算法。

source: The Connection header field (Section 6.1) provides a "close" connection option that a sender SHOULD send when it wishes to close the connection after the current request/response pair.
zh_cn: Connection 首部字段(第 6.1 节)提供了一个“close”连接选项，发送者在希望在当前请求/响应对之后关闭连接时应该发送该选项。

source: The Connection header field's value has the following grammar:
zh_cn: Connection 首部字段的值具有以下语法：

source: The Content-Length header field MUST NOT be sent if these two lengths are different (i.e., if a Transfer-Encoding header field is present).
zh_cn: 如果这两个长度不同(即，如果存在 Transfer-Encoding 首部字段)，则不得发送 Content-Length 首部字段。

source: The DELETE method requests that the origin server delete the resource identified by the Request-URI.
zh_cn: DELETE 方法请求源服务器删除 Request-URI 标识的资源。

source: The DELETE method requests that the origin server remove the association between the target resource and its current functionality.
zh_cn: DELETE 方法请求源服务器删除目标资源与其当前功能之间的关联。

source: The DSA signature is an opaque vector, as above, the contents of which are the DER encoding of:
zh_cn: DSA 签名是一个不透明的 vector，如上所述，其内容是 DER 编码：

source: The EncryptedExtensions message contains extensions that can be protected, i.e., any which are not needed to establish the cryptographic context but which are not associated with individual certificates.
zh_cn: EncryptedExtensions 消息包含可以受到保护的扩展，即，任何不需要建立加密上下文但与单个证书无关的扩展。

source: The Finished message is always sent as part of the Authentication Block.
zh_cn: Finished 消息始终作为认证块的一部分发送。

source: The Finished message is the final message in the Authentication Block.
zh_cn: Finished 消息是验证块中的最后一条消息。

source: The Finished message is the first one protected with the just negotiated algorithms, keys, and secrets.
zh_cn: Finished 消息是刚刚协商的算法，密钥和机密保护的第一个消息。

source: The GET method means retrieve whatever information (in the form of an entity) is identified by the Request-URI.
zh_cn: GET 方法意味着检索由 Request-URI 标识的任何信息(以实体的形式)。

source: The GET method requests transfer of a current selected representation for the target resource.
zh_cn: GET 方法请求传输目标资源的当前所选表示。

source: The HEAD method is identical to GET except that the server MUST NOT return a message-body in the response.
zh_cn: HEAD 方法与 GET 相同，只是服务器不能在响应中返回消息体。

source: The HEAD method is identical to GET except that the server MUST NOT send a message body in the response (i.e., the response terminates at the end of the header section).
zh_cn: HEAD 方法与 GET 相同，除了服务器不得在响应中发送消息体(即响应终止于首部的末尾)。

source: The HMAC-based Extract-and-Expand Key Derivation Function (HKDF) is used as an underlying primitive.
zh_cn: 基于 HMAC 的提取和扩展密钥导出函数(HKDF)用作基础原语。

source: The HTTP interface for a resource is just as likely to be implemented as a tree of content objects, a programmatic view on various database records, or a gateway to other information systems.
zh_cn: 资源的 HTTP 接口很可能实现为内容对象树，各种数据库记录的编程视图或其他信息系统的网关。

source: The HTTP protocol does not place any a priori limit on the length of a URI.
zh_cn: HTTP 协议不对 URI 的长度设置任何先验限制。

source: The HTTP protocol is a request/response protocol.
zh_cn: HTTP 协议是请求/响应协议。

source: The HTTP version number consists of two decimal digits separated by a "." (period or decimal point).
zh_cn: HTTP 版本号由两个以“.”分隔的十进制数字组成。(句号或小数点)。

source: The HTTP version of an application is the highest HTTP version for which the application is at least conditionally compliant.
zh_cn: 应用程序的 HTTP 版本是应用程序至少有条件兼容的最高 HTTP 版本。

source: The HTTP-version ABNF production has been clarified to be case-sensitive.
zh_cn: HTTP 版本的 ABNF 生产已被阐明为区分大小写。

source: The HTTPS URI scheme is now defined by this specification; previously, it was done in Section 2.4 of [RFC2818].
zh_cn: HTTPS URI 方案现在由此规范定义；以前，它是在 [RFC2818] 的第 2.4 节中完成的。

source: The Handshake Protocol is responsible for negotiating a session, which consists of the following items:
zh_cn: 握手协议负责协商会话，其中包括以下项目：

source: The Hash function used by Transcript-Hash and HKDF is the cipher suite hash algorithm.
zh_cn: Transcript-Hash 和 HKDF 使用的 Hash 函数是密码套件哈希算法。

source: The HelloRequest message MAY be sent by the server at any time.
zh_cn: HelloRequest 消息可以由服务器随时发送。

source: The HelloRetryRequest extensions defined in this specification are:
zh_cn: 本规范中定义的 HelloRetryRequest 扩展是：

source: The Host Environment
zh_cn: 主机环境

source: The Host request-header field (section 14.23) MUST accompany all HTTP/1.1 requests.
zh_cn: 主机请求首部字段(第 14.23 节)必须伴随所有 HTTP/1.1 请求。

source: The Hypertext Transfer Protocol (HTTP) is a stateless application-level protocol for distributed, collaborative, hypertext information systems.
zh_cn: 超文本传输​​协议(HTTP)是用于分布式、协作性、超文本信息系统的无状态应用程序级协议。

source: The Hypertext Transfer Protocol (HTTP) is a stateless application-level request/response protocol that uses extensible semantics and self-descriptive message payloads for flexible interaction with network-based hypertext information systems.
zh_cn: 超文本传输​​协议(HTTP)是一种无状态应用程序级请求/响应协议，它使用可扩展语义和自描述消息有效载荷来与基于网络的超文本信息系统进行灵活交互。

source: The Hypertext Transfer Protocol (HTTP) is an application-level protocol for distributed, collaborative, hypermedia information systems.
zh_cn: 超文本传输协议(HTTP)是一种用于分布式、协作性、超媒体信息系统的应用级协议。

source: The ID of a session the client wishes to use for this connection.
zh_cn: 客户端希望用于此连接的会话的 ID。

source: The Initialization Vector (IV) SHOULD be chosen at random, and MUST be unpredictable.
zh_cn: 初始化 Vector (IV)应该随机选择，并且必须不可预测。

source: The Internet Assigned Numbers Authority (IANA) acts as a registry for content-coding value tokens.
zh_cn: 互联网号码分配机构(IANA)充当内容编码值标记的注册机构。

source: The Internet Assigned Numbers Authority (IANA) acts as a registry for transfer-coding value tokens.
zh_cn: 互联网号码分配机构(IANA)充当传输编码值标记的注册机构。

source: The Internet Protocol header carries several information fields, including the source and destination host addresses [2].
zh_cn: Internet 协议首部包含多个信息字段，包括源地址和目标主机地址 [2]。

source: The MAC algorithm specified by SecurityParameters.mac_algorithm.
zh_cn: SecurityParameters.mac_algorithm 指定的 MAC 算法。

source: The MAC is generated as described in Section 6.2.3.1.
zh_cn: MAC 如第 6.2.3.1 节所述生成。

source: The MAC is generated as:
zh_cn: MAC 生成为：

source: The MAC key for this connection, as generated above.
zh_cn: 此连接的 MAC 密钥，如上所示。

source: The MAC of the record also includes a sequence number so that missing, extra, or repeated messages are detectable.
zh_cn: 记录的 MAC 还包括序列号，以便可以检测到丢失，额外或重复的消息。

source: The MD5 and SHA-1 hashing algorithms are steadily weakening in strength and their deprecation process should begin for their use in TLS 1.2 digital signatures.
zh_cn: MD5 和 SHA-1 哈希算法的强度正在逐步减弱，应该开始弃用它们在 TLS 1.2 数字签名中使用。

source: The MIME header fields within each body-part of a multipart message- body do not have any significance to HTTP beyond that defined by their MIME semantics.
zh_cn: 多部分消息体的每个主体部分中的 MIME 首部字段对于超出其 MIME 语义定义的 HTTP 没有任何重要性。

source: The Max-Forwards request-header field MAY be used to target a specific proxy in the request chain.
zh_cn: Max-Forwards 请求首部字段可用于定位请求链中的特定代理。

source: The Method token indicates the method to be performed on the resource identified by the Request-URI.
zh_cn: Method 标记指示要对 Request-URI 标识的资源执行的方法。

source: The NUL octet is no longer allowed in comment and quoted-string text, and handling of backslash-escaping in them has been clarified.
zh_cn: 注释和带引号的文本中不再允许使用 NUL 八位字节，并且已经澄清了对它们进行反斜杠转义的处理。

source: The OPTIONS method represents a request for information about the communication options available on the request/response chain identified by the Request-URI.
zh_cn: OPTIONS 方法表示一个信息请求，请求的信息是有关 Request-URI 标识的请求/响应链上可用的通信选项。

source: The OPTIONS method requests information about the communication options available for the target resource, at either the origin server or an intervening intermediary.
zh_cn: OPTIONS 方法在源服务器或中间中介处请求有关目标资源可用的通信选项的信息。

source: The OWS rule is used where zero or more linear whitespace octets might appear.
zh_cn: OWS 规则用于可能出现零个或多个线性空白八位字节的情况。

source: The Observable type adds two missing semantics to the Gang of Four’s Observer pattern, to match those that are available in the Iterable type:
zh_cn: Observable 类型为 Gang of Four 的观察者模式 添加了两个缺少的语义，以匹配 Iterable 类型中可用的语义：

source: The OpenPGP certificate type [RFC6091] MUST NOT be used with TLS 1.3.
zh_cn: OpenPGP 证书类型 [RFC6091] 不得与 TLS 1.3 一起使用。

source: The Operators of ReactiveX
zh_cn: ReactiveX 的操作符

source: The POST method is used to request that the origin server accept the entity enclosed in the request as a new subordinate of the resource identified by the Request-URI in the Request-Line.
zh_cn: POST 方法用于请求源服务器接受请求中包含的实体作为 Request-Line 中 Request-URI 标识的资源的新下级。

source: The POST method requests that the target resource process the representation enclosed in the request according to the resource's own specific semantics.
zh_cn: POST 方法请求目标资源根据资源自身的特定语义处理请求中包含的表示。

source: The PSK used to encrypt the early data MUST be the first PSK listed in the client's "pre_shared_key" extension.
zh_cn: 用于加密早期数据的 PSK 必须是客户端“pre_shared_key”扩展中列出的第一个 PSK。

source: The PUT method requests that the enclosed entity be stored under the supplied Request-URI.
zh_cn: PUT 方法请求将所包含的实体存储在提供的 Request-URI 下。

source: The PUT method requests that the state of the target resource be created or replaced with the state defined by the representation enclosed in the request message payload.
zh_cn: PUT 方法请求创建或替换目标资源的状态，该状态由请求消息负载中包含的表示定义。

source: The RSAES-OAEP encryption scheme defined in [PKCS1] is more secure against the Bleichenbacher attack.
zh_cn: [PKCS1] 中定义的 RSAES-OAEP 加密方案对 Bleichenbacher 攻击更安全。

source: The RST is acceptable so TCP B processes it and aborts the connection.
zh_cn: RST 是可接受的，因此 TCP B 处理它并中止连接。

source: The RWS rule is used when at least one linear whitespace octet is required to separate field tokens.
zh_cn: 当需要至少一个线性空白八位字节来分隔字段标记时，使用 RWS 规则。

source: The Reactive-Streams specification has its own Subscriber as an interface.
zh_cn: Reactive-Streams 规范有自己的订阅者作为接口。

source: The Reactive-Streams specification mandates operators supporting backpressure, specifically via the guarantee that they don't overflow their consumers when those don't request.
zh_cn: Reactive-Streams 规范要求操作符支持背压，特别是通过保证在没有请求时它们不会溢出消费者。

source: The Reactive-Streams specification took this name for specifying an interaction point between a source and a consumer: `org.reactivestreams.Subscription` allows requesting a positive amount from the upstream and allows cancelling the sequence.
zh_cn: Reactive-Streams 规范使用此名称来指定源和消费者之间的交互点：`org.reactivestreams.Subscription` 允许从上游请求正数量并允许取消序列。

source: The ReactiveX Observable model allows you to treat streams of asynchronous events with the same sort of simple, composable operations that you use for collections of data items like arrays.
zh_cn: ReactiveX Observable 模型允许您使用简单，可组合的操作来处理异步事件流，就像用于数据项集合(如数组)。

source: The Reason-Phrase is intended to give a short textual description of the Status-Code.
zh_cn: Reason-Phrase 旨在提供 Status-Code 的简短文本描述。

source: The Record Protocol can also be used without encryption.
zh_cn: 记录协议也可以在不加密的情况下使用。

source: The Record Protocol can operate without a MAC, but is generally only used in this mode while another protocol is using the Record Protocol as a transport for negotiating security parameters.
zh_cn: 记录协议可以在没有 MAC 的情况下运行，但通常仅在此模式下使用，而另一协议使用记录协议作为协商安全参数的传输。

source: The Record Protocol requires an algorithm to generate keys required by the current connection state (see Appendix A.6) from the security parameters provided by the handshake protocol.
zh_cn: 记录协议需要一个算法来根据握手协议提供的安全参数生成当前连接状态所需的密钥(请参阅附录 A.6)。

source: The Record Protocol takes messages to be transmitted, fragments the data into manageable blocks, optionally compresses the data, applies a MAC, encrypts, and transmits the result.
zh_cn: 记录协议接收要传输的消息，将数据分段为可管理的块，可选地压缩数据，应用 MAC，加密和传输结果。

source: The Request-Line begins with a method token, followed by the Request-URI and the protocol version, and ending with CRLF.
zh_cn: 请求行(Request-Line)以方法标记开头，后跟 Request-URI 和协议版本，以 CRLF 结尾。

source: The Request-URI is a Uniform Resource Identifier (section 3.2) and identifies the resource upon which to apply the request.
zh_cn: Request-URI 是统一资源标识符(第 3.2 节)，用于标识应用请求的资源。

source: The Request-URI is transmitted in the format specified in section 3.2.1.
zh_cn: Request-URI 以 3.2.1 节中指定的格式传输。

source: The SHA-1 algorithm MUST NOT be used in any signatures of CertificateVerify messages.
zh_cn: SHA-1 算法绝不能用于 CertificateVerify 消息的任何签名。

source: The SSLv3 specification was not clear about the encoding of public-key-encrypted data, and therefore many SSLv3 implementations do not include the length bytes -- they encode the RSA-encrypted data directly in the ClientKeyExchange message.
zh_cn: SSLv3 规范未明确公钥加密数据的编码，因此许多 SSLv3 实现不包括长度字节 - 它们直接在 ClientKeyExchange 消息中编码 RSA 加密数据。

source: The SYN and FIN are the only controls requiring this protection, and these controls are used only at connection opening and closing.
zh_cn: SYN 和 FIN 是唯一需要此保护的控制位，这些控制位仅用于连接打开和关闭。

source: The ServerHello MUST only include extensions which are required to establish the cryptographic context and negotiate the protocol version.
zh_cn: ServerHello 必须只包含建立加密上下文和协商协议版本所需的扩展。

source: The ServerHelloDone message is sent by the server to indicate the end of the ServerHello and associated messages.
zh_cn: ServerHelloDone 消息由服务器发送，以指示 ServerHello 和相关消息的结束。

source: The ServerKeyExchange message is sent by the server only when the server Certificate message (if sent) does not contain enough data to allow the client to exchange a premaster secret.
zh_cn: 仅当 Certificate 消息(如果已发送)包含的数据不足以允许客户端交换预主密钥时，服务器才会发送 ServerKeyExchange 消息。

source: The Status-Code element is a 3-digit integer result code of the attempt to understand and satisfy the request.
zh_cn: Status-Code 元素是尝试理解和满足请求的 3 位整数结果代码。

source: The Status-Code is intended for use by automata and the Reason-Phrase is intended for the human user.
zh_cn: Status-Code 旨在供自动机使用，Reason-Phrase 适用于人类用户。

source: The TCP Length is the TCP header length plus the data length in octets (this is not an explicitly transmitted quantity, but is computed), and it does not count the 12 octets of the pseudo header.
zh_cn: TCP 长度是 TCP 报头长度加上八位字节的数据长度(这不是显式发送的数量，而是计算的)，并且它不计算伪首部的 12 个八位字节。

source: The TCP Quiet Time Concept
zh_cn: TCP 安静的时间概念
